{
    "home": "<h1>Hello World</h1><p><img src=\"./images/Me.jpg\" alt=\"Me\">Thank you for taking some time to look into my resume. My name is Rafael Garcia, and I’m currently working towards my bachelor’s in computer science at the University of Texas at El Paso. I’m about to enter my Junior year and I’m very excited about the new knowledge that I will acquire.<br><br>At the moment, I possess multiple technical skills that you may find valuable assets for the multiple projects you are working with. I am currently able to handle proficiently Java, HTML, CSS, especially with Sass. I currently possess some basic to intermediate level knowledge of JavaScript, Python, MATLAB, and C. In order to improve my abilities with such technologies I have developed some projects. An example of these include a program that reads numbers from a list in a text file, processes some calculations, like minimum value, maximum value, and mean variance, and displays the results in a HTML table in Java. Other projects include the testing of the efficiency of multiple sorting and searching algorithms, and a calculator in JavaScript.</p><p>On top of my technical skills, my work background has provided me with useful professional skills. Some of these include being responsible, a fast learner, a good team worker, a good observer, and a problem solver. In the project that I applied these skills the most was the calculator. Here I had to make sure to make time in my schedule to complete the project as fast as possible, and I was able to grasp the concepts easily. I was able to catch details from my code that could create some problems or did not work as intended, and even if I was following instructions in order to learn the language, I had to debug some issues that the code was giving me. I also decided to make this project with some friends from my major,in order to practice developing collaboratively.</p><p>I appreciate you taking the time to read this. I would really appreciate working at your company. I believe my skills will be a valuable asset to the industry. I hope to hear from you soon.</p>",
    "experience": "<h1>Experience</h1><p>Hover on item for details</p><ul><li><h2>Academic Tutor</h2><h4>El Paso Community College (02/23-Present)</h4>- Provided one-on-one and group tutoring to approximately 50 students in a variety of math subjects, including matrix algebra and calculus.<br>- Specialized in assisting students with introductory computer science, covering topics such as computational complexity, algorithm development, and data structures using Java. <br> - Guided students in gaining practical coding skills and problem-solving techniques, promoting confidence and proficiency in computer science-related coursework.</li><br><li><h2>Customer Service Representative</h2><h4>GC Services of El Paso <br>(09/20-01/23)</h4>- Provided customer service and support for Southwest Gas, a natural gas service provider in Arizona, Nevada, and California. <br>- Handled back office tasks such as meter reading corrections, billing adjustments, and account updates. <br>- Responded to customer inquiries and complaints regarding financials, emergency situations, work orders, anddisputes via phone and email.</li><br></ul>",
    "education": "<h1>Education</h1><ul><li><h3>Bachelor’s in science in Computer Science at The University of Texas at El Paso</h3><ul><li>(August 2023 - May 2025). GPA 3.83.</li><li><strong>Relevant coursework: </strong>Matrix Algebra, Probability and Statistics, Discrete Mathema􀆟cs and Digital Systems Design.</li><li>National Science Foundation S-STEM scholar</li></ul></li><br><hr><br><li><h3>Associate in Art in Computer Science at El Paso Community College</h3><ul><li>January 2021 - May 2023</li><li><strong>Relevant coursework: </strong> Programming Fundamentals, and Data Structures and Algorithms.</li></ul></li><br><hr><br></ul>",
    "skills": "<h1>Skills</h1><h2>Technical</h2><table><tr><th>Skill</th><th>Expertise Level</th></tr><tr><td>Java</td><td>2 years</td></tr><tr><td>HTML</td><td>18 months</td></tr><tr><td>CSS</td><td>18 months</td></tr><tr><td>Python</td><td>6 months</td></tr><tr><td>MySQL</td><td>6 months</td></tr><tr><td>JavaScript</td><td>6 months</td></tr><tr><td>Verilog</td><td>3 months</td></tr><tr><td>LabVIEW</td><td>3 months</td></tr><tr><td>Linux</td><td>6 months</td></tr></table><h2>Professional</h2><table><tr><th>Skill</th><th>Expertise level</th></tr><tr><td>Microsoft Office</td><td>10 years</td></tr><tr><td>Customer Service</td><td>2 years</td></tr><tr><td>Spanish</td><td>21 years</td></tr><tr><td>Data Entry</td><td>3 years</td></tr><tr><td>Front Desk</td><td>4 years</td></tr></table>",
    "projects":"<h1>Projects</h1><ul><li><h2><a href=\"https://github.com/unmemero/SortingTesterProject.git\" target=\"_blank\" rel=\"noopener noreferrer\">Sort and Search Algorithm Efficiency tester</a></h2><img src=\"./images/sort.png\" alt=\"Sorting Algorithm\"><p>Test of the computational efficiency of 6 sorting algorithms, and 2 searcching algorithms in java. Included report of computational complexity</p></li><li><h2><a href=\"https://unmemero.github.io/JSCalculator\" target=\"_blank\" rel=\"noopener noreferrer\">JavaScript Calculator</a></h2><img src=\"./images/JS calculator.png\" alt=\"Calculator\"><p>Consists of  basic operations calculator, which uses the string withing the display and the eval() function to perform arithmetic operations. It also posseses a theme toggler on the top</p></li><li><h2><a href=\"#\" target=\"_blank\" rel=\"noopener noreferrer\">Resume Page</a></h2><img src=\"./images/MyResumeWebsite.png\" alt=\"Resume\"><p>Webpage published by using HTML, CSS, JavaScript, Github, and Domain Name. Created as a personal project to t=display my resume in a creative way</p></li></ul>",
    "contact": "<h1>Contact</h1><ul><a href=\"mailto:rgarcia.cs.business@gmail.com\"><li><i class=\"fa-solid fa-envelope\" style=\"color: #ffffff;\"></i> Email</li></a><a href=\"tel:+1 915-227-0003\"><li><i class=\"fa-solid fa-phone\" style=\"color: #ffffff;\"></i> Phone</li></a><a href=\"https://www.linkedin.com/in/rafael-garcia-737931206/\" target=\"_blank\" rel=\"noopener noreferrer\"><li><i class=\"fa-brands fa-linkedin\" style=\"color: #ffffff;\"></i> LinkedIn</li></a></ul><h2>or send me a message</h2><form method=\"post\" id=\"contact-form\"><input type=\"text\" placeholder=\"Name\" id=\"contact-name\" required><input type=\"text\" placeholder=\"Email\" id=\"contact-email\" required><textarea name=\"message\" id=\"contact-message\" cols=\"30\" rows=\"10\" placeholder=\"Your message\"required></textarea><button type=\"submit\" id=\"contactButton\">Submit</button></form>",
    "download":"<h1>Download</h1><a href=\"./Rafael Garcia Resume - 5.pdf\" download><div id=\"middle-line\"></div><div id=\"triangle\"></div></a>"
}
